# Question 8
Write SQL queries on the below database table that return:
a) All the temperature data.
b) All the cities, but without repetition.
c) All the records for India.
d) All the Fall records.
e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.
f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.
g) The total annual rainfall for Cairo.
h) The total rainfall for each season.

Refernce Used :
https://www.youtube.com/watch?v=sDY_fKe_JVw

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\josep\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython>=1.0 in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: sqlparse in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\josep\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: decorator in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: pickleshare in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: jedi>=0.16 in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: traitlets>=4.2 in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: backcall in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\josep\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\josep\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\josep\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\josep\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)

In [2]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db               #Chinook is a sample database used in SQL Server, Oracle, MySQL, etc.

In [3]:
%%sql
CREATE TABLE world_weather(City string,Country string,Season string,Temperature float ,Rainfall float);

 * sqlite:///chinook.db
Done.

[]

In [4]:
%%sql
INSERT INTO world_weather VALUES('Mumbai','India', 'Winter',24.8,5.9);
INSERT INTO world_weather VALUES('Mumbai','India', 'Spring',28.4,16.2);
INSERT INTO world_weather VALUES('Mumbai','India', 'Summer',27.9,1549.4);
INSERT INTO world_weather VALUES('Mumbai','India', 'Fall',27.6,346.0);
INSERT INTO world_weather VALUES('London','United Kingdom', 'Winter',4.2,207.7);
INSERT INTO world_weather VALUES('London','United Kingdom', 'Spring',8.3,169.6);
INSERT INTO world_weather VALUES('London','United Kingdom', 'Summer',15.7,157.0);
INSERT INTO world_weather VALUES('London','United Kingdom', 'Fall',10.4,218.5);
INSERT INTO world_weather VALUES('Cairo','Eqypt', 'Winter',13.6,16.5);
INSERT INTO world_weather VALUES('Cairo','Eqypt', 'Spring',20.7,6.5);
INSERT INTO world_weather VALUES('Cairo','Eqypt', 'Summer',27.7,0.1);
INSERT INTO world_weather VALUES('Cairo','Eqypt', 'Fall',22.2,4.5);

 * sqlite:///chinook.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
select * from world_weather;

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Eqypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Eqypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Eqypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Eqypt', 'Fall', 22.2, 4.5)]

In [6]:
# a) Retrieving Temperature Data

%sql select Temperature from world_weather;

 * sqlite:///chinook.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [7]:
# b) All the cities, but without repetition

%sql select distinct City from world_weather;

 * sqlite:///chinook.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [8]:
# c) All the records for India.

%sql SELECT * FROM world_weather WHERE Country = 'India';

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [9]:
# d) All the Fall records.

%sql select * from world_weather where season = 'Fall';

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Eqypt', 'Fall', 22.2, 4.5)]

In [10]:
# e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

%sql select city,country,season from (select city,country,season,avg(rainfall) as avg_rainfall from world_weather group by city,country,season)A where avg_rainfall between 200 and 400;

 * sqlite:///chinook.db
Done.

[('London', 'United Kingdom', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('Mumbai', 'India', 'Fall')]

In [11]:
# f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

%sql select city,country from (select city,country,avg(Temperature) as avg_temp from world_weather where season = 'Fall' group by city,country)A where avg_temp > 20  order by avg_temp;

 * sqlite:///chinook.db
Done.

[('Cairo', 'Eqypt'), ('Mumbai', 'India')]

In [12]:
# g) The total annual rainfall for Cairo.

%sql select sum(rainfall) as Total_Annual_Rainfall from world_weather where city = 'Cairo';

 * sqlite:///chinook.db
Done.

[(27.6,)]

In [13]:
# h) The total rainfall for each season.

%sql select season, round(sum(rainfall),1) as Total_Annual_Rainfall  from world_weather group by season;

#Rounding off to 1 decimal place for better view in output

 * sqlite:///chinook.db
Done.

[('Fall', 569.0), ('Spring', 192.3), ('Summer', 1706.5), ('Winter', 230.1)]